; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	image1 - mode
	thermograph4 - mode
	image0 - mode
	image2 - mode
	spectrograph3 - mode
	Star0 - direction
	GroundStation2 - direction
	Star1 - direction
	Star3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Star17 - direction
	Star18 - direction
	Planet19 - direction
	Planet20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star18)
	(supports instrument1 image2)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 Star0)
	(supports instrument3 image2)
	(supports instrument3 image1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument4 spectrograph3)
	(supports instrument4 image2)
	(calibration_target instrument4 Star1)
	(supports instrument5 image2)
	(calibration_target instrument5 Star1)
	(supports instrument6 image2)
	(supports instrument6 thermograph4)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet19)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 image2)
	(supports instrument8 image0)
	(calibration_target instrument8 Star1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument9 spectrograph3)
	(calibration_target instrument9 Star1)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon4)
)
(:goal (and
	(pointing satellite0 Phenomenon15)
	(pointing satellite1 Star17)
	(pointing satellite2 Star1)
	(have_image Phenomenon4 image2)
	(have_image Phenomenon5 image0)
	(have_image Star6 image2)
	(have_image Planet7 spectrograph3)
	(have_image Planet8 image0)
	(have_image Star9 spectrograph3)
	(have_image Planet10 image0)
	(have_image Planet11 spectrograph3)
	(have_image Phenomenon13 image0)
	(have_image Planet14 thermograph4)
	(have_image Phenomenon15 spectrograph3)
	(have_image Star16 image1)
	(have_image Star17 image1)
	(have_image Planet20 image0)
	(have_image Planet21 image1)
))

)

; plan
1. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 0 of 18
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 18
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 18
4. (turn_to satellite4 phenomenon15 phenomenon4)
   deleted: (pointing satellite4 phenomenon4)
   added: (pointing satellite4 phenomenon15)
   goals met: 0 of 18
5. (turn_to satellite4 star1 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 star1)
   goals met: 0 of 18
6. (calibrate satellite4 instrument9 star1)
   added: (calibrated instrument9)
   goals met: 0 of 18
7. (turn_to satellite4 phenomenon15 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon15)
   goals met: 0 of 18
8. (take_image satellite4 phenomenon15 instrument9 spectrograph3)
   added: (have_image phenomenon15 spectrograph3)
   goals met: 1 of 18
9. (turn_to satellite4 planet11 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 planet11)
   goals met: 1 of 18
10. (take_image satellite4 planet11 instrument9 spectrograph3)
   added: (have_image planet11 spectrograph3)
   goals met: 2 of 18
11. (turn_to satellite4 planet7 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet7)
   goals met: 2 of 18
12. (take_image satellite4 planet7 instrument9 spectrograph3)
   added: (have_image planet7 spectrograph3)
   goals met: 3 of 18
13. (turn_to satellite4 star9 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 star9)
   goals met: 3 of 18
14. (take_image satellite4 star9 instrument9 spectrograph3)
   added: (have_image star9 spectrograph3)
   goals met: 4 of 18
15. (turn_to satellite2 groundstation2 planet19)
   deleted: (pointing satellite2 planet19)
   added: (pointing satellite2 groundstation2)
   goals met: 4 of 18
16. (calibrate satellite2 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 4 of 18
17. (turn_to satellite2 phenomenon4 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon4)
   goals met: 4 of 18
18. (take_image satellite2 phenomenon4 instrument6 image2)
   added: (have_image phenomenon4 image2)
   goals met: 5 of 18
19. (turn_to satellite2 planet14 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 planet14)
   goals met: 5 of 18
20. (take_image satellite2 planet14 instrument6 thermograph4)
   added: (have_image planet14 thermograph4)
   goals met: 6 of 18
21. (turn_to satellite2 star1 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 star1)
   goals met: 7 of 18
22. (turn_to satellite1 phenomenon13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon13)
   goals met: 7 of 18
23. (turn_to satellite1 star1 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star1)
   goals met: 7 of 18
24. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 7 of 18
25. (turn_to satellite1 phenomenon13 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon13)
   goals met: 7 of 18
26. (take_image satellite1 phenomenon13 instrument3 image0)
   added: (have_image phenomenon13 image0)
   goals met: 8 of 18
27. (turn_to satellite1 phenomenon5 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon5)
   goals met: 8 of 18
28. (take_image satellite1 phenomenon5 instrument3 image0)
   added: (have_image phenomenon5 image0)
   goals met: 9 of 18
29. (turn_to satellite1 planet10 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet10)
   goals met: 9 of 18
30. (take_image satellite1 planet10 instrument3 image0)
   added: (have_image planet10 image0)
   goals met: 10 of 18
31. (turn_to satellite1 planet20 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet20)
   goals met: 10 of 18
32. (take_image satellite1 planet20 instrument3 image0)
   added: (have_image planet20 image0)
   goals met: 11 of 18
33. (turn_to satellite1 planet21 planet20)
   deleted: (pointing satellite1 planet20)
   added: (pointing satellite1 planet21)
   goals met: 11 of 18
34. (take_image satellite1 planet21 instrument3 image1)
   added: (have_image planet21 image1)
   goals met: 12 of 18
35. (turn_to satellite1 planet8 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 planet8)
   goals met: 12 of 18
36. (take_image satellite1 planet8 instrument3 image0)
   added: (have_image planet8 image0)
   goals met: 13 of 18
37. (turn_to satellite1 star16 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star16)
   goals met: 13 of 18
38. (take_image satellite1 star16 instrument3 image1)
   added: (have_image star16 image1)
   goals met: 14 of 18
39. (turn_to satellite1 star17 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star17)
   goals met: 15 of 18
40. (take_image satellite1 star17 instrument3 image1)
   added: (have_image star17 image1)
   goals met: 16 of 18
41. (turn_to satellite0 phenomenon15 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 phenomenon15)
   goals met: 17 of 18
42. (turn_to satellite2 star6 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 star6)
   goals met: 16 of 18
43. (take_image satellite2 star6 instrument6 image2)
   added: (have_image star6 image2)
   goals met: 17 of 18
44. (turn_to satellite2 star1 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star1)
   goals met: 18 of 18
